externalSolarLoadV10/0.orig/air/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    maxY
    {
        type            calculated;
        value           uniform 0;
    }

    minX
    {
        type            calculated;
        value           uniform 0;
    }

    maxX
    {
        type            calculated;
        value           uniform 0;
    }

    minY
    {
        type            calculated;
        value           uniform 0;
    }

    maxZ
    {
        type            calculated;
        value           uniform 0;
    }

    air_to_floor
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }

    air_to_solid
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
}


// ************************************************************************* //
